Q1. List any five functions of the pandas library with execution.

In [180]:
# Functions of Pandas are as following:-
 
# 1) Head()..

import pandas as pd
data = {'Name': ['Rahul', 'Subhash', 'Sahil', 'Rakesh', 'Manju'],
        'Age': [23, 26, 22, 21, 24],
        'City': ['kolkata', 'Howrah', 'Mumbai', 'Bengaluru', 'Delhi']}
df = pd.DataFrame(data)
df.head()

      Name  Age       City
0    Rahul   23    kolkata
1  Subhash   26     Howrah
2    Sahil   22     Mumbai
3   Rakesh   21  Bengaluru
4    Manju   24      Delhi

In [181]:
# 2) Describe()..

import pandas as pd
data = {'Name': ['Rahul', 'Subhash', 'Sahil', 'Rakesh', 'Manju'],
        'Age': [23, 26, 22, 21, 24],
        'City': ['kolkata', 'Howrah', 'Mumbai', 'Bengaluru', 'Delhi']}
df = pd.DataFrame(data)
df.describe()

             Age
count   5.000000
mean   23.200000
std     1.923538
min    21.000000
25%    22.000000
50%    23.000000
75%    24.000000
max    26.000000

In [182]:
# 3) Tail()..

import pandas as pd
data = {'Name': ['Rahul', 'Subhash', 'Sahil', 'Rakesh', 'Manju'],
        'Age': [23, 26, 22, 21, 24],
        'City': ['kolkata', 'Howrah', 'Mumbai', 'Bengaluru', 'Delhi']}
df = pd.DataFrame(data)
df.tail(2)

     Name  Age       City
3  Rakesh   21  Bengaluru
4   Manju   24      Delhi

In [183]:
# 4) groupby()..

import pandas as pd
data = {'Name': ['Rahul', 'Subhash', 'Sahil', 'Rakesh', 'Manju'],
        'Age': [23, 26, 22, 21, 24],
        'City': ['kolkata', 'Howrah', 'Mumbai', 'Bengaluru', 'Delhi']}
df = pd.DataFrame(data)

In [184]:
group_data = df.groupby('Age')

In [185]:
group_data.sum()

        Name       City
Age
21    Rakesh  Bengaluru
22     Sahil     Mumbai
23     Rahul    kolkata
24     Manju      Delhi
26   Subhash     Howrah

In [186]:
# 5) sort_values()..

import pandas as pd
data = {'Name': ['Rahul', 'Subhash', 'Sahil', 'Rakesh', 'Manju'],
        'Age': [23, 26, 22, 21, 24],
        'City': ['kolkata', 'Howrah', 'Mumbai', 'Bengaluru', 'Delhi']}
df = pd.DataFrame(data)
df.sort_values('Age', ascending=False)

      Name  Age       City
1  Subhash   26     Howrah
4    Manju   24      Delhi
0    Rahul   23    kolkata
2    Sahil   22     Mumbai
3   Rakesh   21  Bengaluru

Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the 
DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [187]:
data = pd.DataFrame({'A': ['Rahul', 'Subhash', 'Sahil', 'Rakesh', 'Manju'],
                        'B': [23, 26, 22, 21, 24],
                        'C': ['kolkata', 'Howrah', 'Mumbai', 'Bengaluru', 'Delhi']},
                        index = [1,3,5,7,9])

data

         A   B          C
1    Rahul  23    kolkata
3  Subhash  26     Howrah
5    Sahil  22     Mumbai
7   Rakesh  21  Bengaluru
9    Manju  24      Delhi

In [148]:
data.reindex([3,1,7,5,9])

         A   B          C
3  Subhash  26     Howrah
1    Rahul  23    kolkata
7   Rakesh  21  Bengaluru
5    Sahil  22     Mumbai
9    Manju  24      Delhi

Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that 
iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The 
function should print the sum to the console.

For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should 
calculate and print the sum of the first three values, which is 60

In [149]:
import pandas as pd
def cal_sum(df):
    value_column = df['Values']
    sum_of_three_value = value_column[0:3]
    total_sum = sum_of_three_value.sum()
    print(total_sum)
    
df = pd.DataFrame({'Values': [10,20,30,40,50]})
cal_sum(df)

60

Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column 
'Word_Count' that contains the number of words in each row of the 'Text' column

In [152]:
pd.set_option("display.max_colwidth", 150)
df = pd.DataFrame({'Text': ['My name is Rahul Kumar Jha and I am preparing for Data Science Master 2.0. This course is panacea for Data Science students.']})
df['Word_Count'] = df['Text'].apply(len)
df

,Text,Word_Count
0,My name is Rahul Kumar Jha and I am preparing for Data Science Master 2.0. This course is panacea for Data Science students.,124

Q5. How are DataFrame.size() and DataFrame.shape() different?

In [151]:
## DataFrame.size gives you the total number of elements in the DataFrame, 
## while DataFrame.shape provides the dimensions of the DataFrame as a tuple (number of rows, number of columns).

# eample of DataFrame.size()....

import pandas as pd
data = {'A': [1, 2, 3],
        'B': [4, 5, 6]}
df = pd.DataFrame(data)
print(df.size)

6

In [153]:
# eample of DataFrame.shape()....

import pandas as pd
data = {'A': [1, 2, 3],
        'B': [4, 5, 6]}
df = pd.DataFrame(data)
print(df.shape)

(3, 2)

Q6. Which function of pandas do we use to read an excel file?

In [154]:
# "read_excel()" function of pandas, we use to read excel file

Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email 
addresses in the format 'username@domain.com'. Write a Python function that creates a new column 
'Username' in df that contains only the username part of each email address.

The username is the part of the email address that appears before the '@' symbol. For example, if the 
email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your 
function should extract the username from each email address and store it in the new 'Username' 
column

In [155]:
import pandas as pd
df = pd.DataFrame({'Email':['rahul2807jha@gmail.com', 'xyz@gmail.com', 'abc@gmail.com']})
df['Username'] = df['Email'].apply(lambda x: x.split('@')[0])
df

                    Email      Username
0  rahul2807jha@gmail.com  rahul2807jha
1           xyz@gmail.com           xyz
2           abc@gmail.com           abc

Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects 
all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The 
function should return a new DataFrame that contains only the selected rows.

For example, if df contains the following values:

   A   B   C

0  3   5   1

1  8   2   7

2  6   9   4

3  2   3   5

4  9   1   2

Your function should select the following rows:   A   B   C

1  8   2   7

4  9   1   2

The function should return a new DataFrame that contains only the selected rows.

In [188]:
import pandas as pd

df = pd.DataFrame({'A':[3,8,6,2,9],
                  'B':[5,2,9,3,1],
                  'C':[1,7,4,5,2]})
df

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [157]:
df[(df['A']>5) & (df['B']<10)]

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean, 
median, and standard deviation of the values in the 'Values' column.

In [158]:
import pandas as pd
df = pd.DataFrame({'Values': [3, 8, 6, 2, 9, 5, 1]})
print(df['Values'].mean())
print(df['Values'].median())
print(df['Values'].std())

4.857142857142857
5.0
3.023715784073818

Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to 
create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days 
for each row in the DataFrame. The moving average should be calculated using a window of size 7 and 
should include the current day

In [159]:
df = pd.DataFrame({
    'Date': ['2023-06-01', '2023-06-02', '2023-06-03', '2023-06-04', '2023-06-05', '2023-06-06', '2023-06-07',
             '2023-06-08', '2023-06-09', '2023-06-10'],
    'Sales': [10, 12, 15, 18, 14, 20, 22, 25, 28, 30]
})

In [160]:
df

         Date  Sales
0  2023-06-01     10
1  2023-06-02     12
2  2023-06-03     15
3  2023-06-04     18
4  2023-06-05     14
5  2023-06-06     20
6  2023-06-07     22
7  2023-06-08     25
8  2023-06-09     28
9  2023-06-10     30

In [161]:
df['MovingAverage'] = df['Sales'].rolling(window=7).mean()

In [162]:
df

         Date  Sales  MovingAverage
0  2023-06-01     10            NaN
1  2023-06-02     12            NaN
2  2023-06-03     15            NaN
3  2023-06-04     18            NaN
4  2023-06-05     14            NaN
5  2023-06-06     20            NaN
6  2023-06-07     22      15.857143
7  2023-06-08     25      18.000000
8  2023-06-09     28      20.285714
9  2023-06-10     30      22.428571

Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new 
column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g. 
Monday, Tuesday) corresponding to each date in the 'Date' column.

For example, if df contains the following values:

         Date

0  2023-01-01

1  2023-01-02

2  2023-01-03

3  2023-01-04

4  2023-01-05

Your function should create the following DataFrame:


         Date    Weekday

0  2023-01-01    Sunday

1  2023-01-02     Monday

2  2023-01-03    Tuesday

3  2023-01-04    Wednesday

4  2023-01-05    Thursday

The function should return the modified DataFrame

In [172]:
import pandas as pd
df = pd.DataFrame({'date': ['2023-01-01','2023-01-02','2023-01-03','2023-01-04','2023-01-05']})
df['Weekday'] = pd.to_datetime(df['date']).dt.day_name()
df

         date    Weekday
0  2023-01-01     Sunday
1  2023-01-02     Monday
2  2023-01-03    Tuesday
3  2023-01-04  Wednesday
4  2023-01-05   Thursday

Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python 
function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to 
be imported

In [164]:
# To use the basic functions of Pandas, the first and foremost necessary library that needs to be imported is pandas itself.